app/controllers/exercises_controller.rb

  def index
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @user = User.find(params[:user_id])
    @exercise = Exercise.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @user = User.find(params[:user_id])
    @exercise = Exercise.find(params[:id])
    respond_to do |format|
      if @exercise.update(exercise_params)
        @exercise.etypes.delete(@exercise.etypes.first) if not(@exercise.etypes.empty?)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "exercises" SET "name" = ?, "updated_at" = ? WHERE "exercises"."id" = ?  [["name", "Arms Down TEST"], ["updated_at", 2017-03-18 03:28:25 UTC], ["id", 2]]
SELECT  "etypes".* FROM "etypes" INNER JOIN "etypes_exercises" ON "etypes"."id" = "etypes_exercises"."etype_id" WHERE "etypes_exercises"."exercise_id" = ? ORDER BY "etypes"."id" ASC LIMIT ?  [["exercise_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "etypes" INNER JOIN "etypes_exercises" ON "etypes"."id" = "etypes_exercises"."etype_id" WHERE "etypes_exercises"."exercise_id" = ? LIMIT ?  [["exercise_id", 2], ["LIMIT", 1]]

    def set_exercise
      @exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]