app/views/exercises/index.html.erb

      <tbody class="inshtaex">
        <% @user.exercises.each do |exercise| %>
          <tr>
            <td><%= not(exercise.etypes.empty?) ? exercise.etypes.first.name + (exercise.etypes.size > 1 ?  " (+#{exercise.etypes.size - 1})" : "") : "" %></td>
            <td><%= exercise.name %></td>
            <td><%= exercise.muscles.size > 1 ? exercise.muscles.first.name + "" + "" + " (+)#{exercise.muscles.size - 1}" : exercise.muscles.first.name %></td>
            <td><%= exercise.equipment.size > 1 ? exercise.equipment.first.name + "" + "" + " (+)#{exercise.equipment.size - 1}" : exercise.equipment.first.name %></td>
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = ?  [["user_id", 1]]
SELECT  "etypes".* FROM "etypes" INNER JOIN "etypes_exercises" ON "etypes"."id" = "etypes_exercises"."etype_id" WHERE "etypes_exercises"."exercise_id" = ? ORDER BY "etypes"."id" ASC LIMIT ?  [["exercise_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "etypes" INNER JOIN "etypes_exercises" ON "etypes"."id" = "etypes_exercises"."etype_id" WHERE "etypes_exercises"."exercise_id" = ? LIMIT ?  [["exercise_id", 1], ["LIMIT", 1]]
SELECT  "muscles".* FROM "muscles" INNER JOIN "exercises_muscles" ON "muscles"."id" = "exercises_muscles"."muscle_id" WHERE "exercises_muscles"."exercise_id" = ? ORDER BY "muscles"."id" ASC LIMIT ?  [["exercise_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "muscles" INNER JOIN "exercises_muscles" ON "muscles"."id" = "exercises_muscles"."muscle_id" WHERE "exercises_muscles"."exercise_id" = ?  [["exercise_id", 1]]
SELECT  "equipment".* FROM "equipment" INNER JOIN "equipment_exercises" ON "equipment"."id" = "equipment_exercises"."equipment_id" WHERE "equipment_exercises"."exercise_id" = ? ORDER BY "equipment"."id" ASC LIMIT ?  [["exercise_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "equipment" INNER JOIN "equipment_exercises" ON "equipment"."id" = "equipment_exercises"."equipment_id" WHERE "equipment_exercises"."exercise_id" = ?  [["exercise_id", 1]]